misim-bus/misim-bus-core/src/test/resources/xml/peticionConsultaNotifica_nuevo.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header/>
	<soap:Body>
		<Peticion xmlns="http://intermediacion.redsara.es/scsp/esquemas/V3/peticion" xmlns:ns2="http://intermediacion.redsara.es/scsp/esquemas/datosespecificos" xmlns:ns3="http://intermediacion.redsara.es/scsp/esquemas/V3/respuesta">
			<Atributos>
				<IdPeticion>1</IdPeticion>
				<NumElementos>1</NumElementos>
				<TimeStamp>2014-12-17 18:50:25.000058</TimeStamp>
				<Estado>
					<CodigoEstado/>
					<CodigoEstadoSecundario/>
					<LiteralError/>
					<TiempoEstimadoRespuesta>0</TiempoEstimadoRespuesta>
				</Estado>
				<CodigoCertificado>NOTIFICA_001</CodigoCertificado>
			</Atributos>
			<Solicitudes>
				<SolicitudTransmision>
					<DatosGenericos>
						<Emisor>
							<NifEmisor>S2833002E</NifEmisor>
							<NombreEmisor>NOMBREPLATAFORMA</NombreEmisor>
						</Emisor>
						<Solicitante>
							<IdentificadorSolicitante>A1234567B</IdentificadorSolicitante>
							<NombreSolicitante>CARPETA</NombreSolicitante>
							<UnidadTramitadora>MINHAP</UnidadTramitadora>
							<Finalidad>CONSULTA</Finalidad>
							<Consentimiento>SI</Consentimiento>
							<IdExpediente>0000</IdExpediente>
						</Solicitante>
						<Titular>
							<Documentacion>12345678Z</Documentacion>
						</Titular>
						<Transmision>
							<CodigoCertificado>NOTIFICA_001</CodigoCertificado>
							<IdSolicitud>1</IdSolicitud>
							<IdTransmision/>
							<FechaGeneracion/>
						</Transmision>
					</DatosGenericos>
					<ns2:DatosEspecificos>
						<get_envios>
							<nif>12345678Z</nif>
							<estado>Pendiente</estado>
							<organismo_remisor>codigo</organismo_remisor>
							<codigo_sia>codigoSIA</codigo_sia>
							<fecha_desde>2014-07-01T00:00:00+02:00</fecha_desde>
							<fecha_hasta>2014-09-02T00:00:00+02:00</fecha_hasta>
						</get_envios>
					</ns2:DatosEspecificos>
				</SolicitudTransmision>
			</Solicitudes>
		</Peticion>
	</soap:Body>
</soap:Envelope>
