misim-bus/misim-bus-core/target/test-classes/xml/peticionDetalleNotifica_nuevo.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header/>
	<soap:Body>
		<Peticion xmlns="http://intermediacion.redsara.es/scsp/esquemas/V3/peticion" xmlns:ns2="http://intermediacion.redsara.es/scsp/esquemas/datosespecificos" xmlns:ns3="http://intermediacion.redsara.es/scsp/esquemas/V3/respuesta">
			<Atributos>
				<IdPeticion>1</IdPeticion>
				<NumElementos>1</NumElementos>
				<TimeStamp>2014-12-23 17:18:01.000625</TimeStamp>
				<Estado>
					<CodigoEstado/>
					<CodigoEstadoSecundario/>
					<LiteralError/>
					<TiempoEstimadoRespuesta>0</TiempoEstimadoRespuesta>
				</Estado>
				<CodigoCertificado>NOTIFICA_002</CodigoCertificado>
			</Atributos>
			<Solicitudes>
				<SolicitudTransmision>
					<DatosGenericos>
						<Emisor>
							<NifEmisor>S2833002E</NifEmisor>
							<NombreEmisor>NOMBREPLATAFORMA</NombreEmisor>
						</Emisor>
						<Solicitante>
							<IdentificadorSolicitante>A1234567B</IdentificadorSolicitante>
							<NombreSolicitante>CARPETA</NombreSolicitante>
							<UnidadTramitadora>MINHAP</UnidadTramitadora>
							<Finalidad>CONSULTA</Finalidad>
							<Consentimiento>SI</Consentimiento>
							<IdExpediente>0000</IdExpediente>
						</Solicitante>
						<Titular>
							<Documentacion>12345678Z</Documentacion>
						</Titular>
						<Transmision>
							<CodigoCertificado>NOTIFICA_002</CodigoCertificado>
							<IdSolicitud>1</IdSolicitud>
							<IdTransmision/>
							<FechaGeneracion/>
						</Transmision>
					</DatosGenericos>
					<ns2:DatosEspecificos>
						<ns2:infoEnvio xmlns:ns2="https://administracionelectronica.gob.es/notifica/ws/notifica/1.0/">
							<envio_destinatario xmlns="" xmlns:ns5="http://intermediacion.redsara.es/scsp/esquemas/V3/peticion">40</envio_destinatario>
						</ns2:infoEnvio>
					</ns2:DatosEspecificos>
				</SolicitudTransmision>
			</Solicitudes>
		</Peticion>
	</soap:Body>
</soap:Envelope>
